# GetTileBackgroundColor

## Description
Gets the specified tile resource's background color.

```pascal
PROCEDURE GetTileBackgroundColor(
				tileHandle : HANDLE;
				VAR red    : LONGINT;
				VAR green  : LONGINT;
				VAR blue   : LONGINT);
```

```python
def vs.GetTileBackgroundColor(tileHandle):
    return (red, green, blue)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|tileHandle|HANDLE|The tile resource from which to get the background color.|
|red|LONGINT|Returns RGB color component value.|
|green|LONGINT|Returns RGB color component value.|
|blue|LONGINT|Returns RGB color component value.|

## Examples
```pascal
GetTileBackgroundColor(tileHandle, backgroundColor);
```

```pascal
GetTileBackgroundColor(tileHandle, 1, 2, 3);
```
```python
import vs

# Gets the specified tile resource's background color.
tileHandle = vs.FSActLayer()  # handle to the first selected object on the active layer

red, green, blue = vs.GetTileBackgroundColor(tileHandle)
vs.Message('GetTileBackgroundColor returned: ' + str((red, green, blue)))
```

## See Also
VS Functions:
CreateTile
| ShowEditTileDialog
| ShowEditTileSettingsDialog
| ShowNewTileDialog
| GetTileGeometryGroup
| BeginGroupN
| AddTileGeometryObject
| GetTileGroupParent
| IsTileGroupContainedObject
| GetTileBackgroundColor
| SetTileBackgroundColor
| GetTileRepetitionPoint
| SetTileRepetitionPoint
| GetTileOffsetPoint
| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011

## Category
* Document Attributes